Revit 2027 API
Transform1D.SetToIdentity Method
 Set this TrfUV to the identity transform
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform1D SetToIdentity()
Public Function SetToIdentity As Transform1D
public:
Transform1D^ SetToIdentity()
member SetToIdentity : unit -> Transform1D
Return Value
Transform1D
 Returns a pointer to "this" Transform1D.
See Also
Reference
Transform1D Class
Autodesk.Revit.DB Namespace